#include <stdint.h>

int main(void){
    *(uint32_t*)(0x40023800UL + 0x30UL) |= 0x06UL; //Включение тактирования порта GPIOB

    *(uint32_t*)(0x40020400UL+0x00UL) |= 0x4000UL; //Настройка работы 7-го пина GPIOB в режиме вывода сигнала
    *(uint32_t*)(0x40020400UL+0x04UL) |= 0x00UL; //Настройка на PushPull работу 7-го пина GPIOB
    *(uint32_t*)(0x40020400UL+0x08UL) |= 0x4000UL; //Настройка скорости работы 7-го пина GPIOB на среднюю
    *(uint32_t*)(0x40020400UL+0x18UL) |= 0x800000UL; //Отключение PU/PDрезисторов для 7-го пина GPIOB
    // Кнопку подключаем к PC13 или к PC12 если кнопка сломана
    while(1)
    {
        if (*(uint32_t*)(0x40020800UL + 0x10UL) & 0x2000UL)
        {
            *(uint32_t*)(0x40020400UL+0x18UL) |= 0x80UL;
        }
        else
        {
            *(uint32_t*)(0x40020400UL+0x18UL) |= 0x800000UL;
        }
    
    
    }
}